<!DOCTYPE HTML>
<html>
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<head>
<title>CCNA考试命令集总结  - java学习网</title>
    <link rel="stylesheet" href="/r/cms/www/default/css/xiangmu.css">
	<link rel="stylesheet" href="/editor/themes/default/default.css" />
	<link rel="stylesheet" href="/editor/plugins/code/prettify.css" />
	<script src="/r/cms/www/default/js/jquery-3.1.0-min.js"></script>
	<script charset="utf-8" src="/editor/kindeditor.js"></script>
	<script charset="utf-8" src="/editor/lang/zh_CN.js"></script>
	<script charset="utf-8" src="/editor/plugins/code/prettify.js"></script>
	<script src="/r/cms/front.js" type="text/javascript"></script>
	
</head>

<script type="text/javascript">
$(function() {
		Cms.attachment("","697","0","attach");
		Cms.viewCount("","697");
		Cms.siteFlow("", location.href, document.referrer);
	    prettyPrint();
	});
</script>

<style>
pre.prettyprint{
background-color: #fff;
border:2px solid #e2e2e2;
white-space: pre;
overflow:auto;
}
</style>
<body style="margin:0 0;">
<div style="width:1100px; margin:0 auto;height:120px; margin-top:20px;">
    <span style="float:left;">
	<a href="http://www.javaxuexi.net:80/" style="cursor:point;border:0;">
	  <img height="100" src="/r/cms/www/default/img/javaxuexi_logo.gif"/>
	</a>
	</span>
	<form action="/search.jspx" target="_blank" id="searchForm">
		<span style="float:right; margin-top:33px;">
		   <span style=" border:1px solid #888;height:32px; display:block; float:left; width:350px;">
		     <input name="q" value="" style="border:none;height:30px; width:346px;" type="text"/>
		   </span>
		   <span style="display:block; float:left;height:32px; background-color:#888; border:1px solid #888;">
		     <input class="xm-s-bt" style="height:32px; border:none;" type="submit" value="搜索一下"/>
		   </span>
		</span>
	</form>
</div>

<div style="width:100%; background:#20b573;">
   <div style="width:1100px; margin:0 auto;">
     <span style="float:left; font-size:18px;">
	     <dl style="margin:20px 0;">
		   <dt>
		   <a href="http://www.javaxuexi.net:80/" style="font-weight:600;">首页</a>
		   </dt>
		 </dl>
	 </span>
     <ul style="list-style:none; margin:0; padding:0; float:right; font-size:18px;color:#333;">
       <li style="float:left; width:150px; text-align:center;">
	     <dl style="margin:20px 0;">
		   <dt>
		   <a href="http://www.javaxuexi.net:80/webstudy/index.jhtml" target="_blank" style="font-weight:600;" >Web学习</a>
		   </dt>
		 </dl>
	   </li>
       <li style="float:left; width:150px; text-align:center;">
	     <dl style="margin:20px 0;">
		   <dt>
		   <a href="http://www.javaxuexi.net:80/framework/index.jhtml" target="_blank" style="font-weight:600;" >框架专区</a>
		   </dt>
		 </dl>
	   </li>
       <li style="float:left; width:150px; text-align:center;">
	     <dl style="margin:20px 0;">
		   <dt>
		   <a href="http://www.javaxuexi.net:80/download/index.jhtml" target="_blank" style="font-weight:600;" >软件工具下载</a>
		   </dt>
		 </dl>
	   </li>
       <li style="float:left; width:150px; text-align:center;">
	     <dl style="margin:20px 0;">
		   <dt>
		   <a href="http://www.javaxuexi.net:80/entertainment/index.jhtml" target="_blank" style="font-weight:600;" >生活娱乐</a>
		   </dt>
		 </dl>
	   </li>
       <li style="float:left; width:150px; text-align:center;">
	     <dl style="margin:20px 0;">
		   <dt>
		   <a href="http://www.javaxuexi.net:80/photo/index.jhtml" target="_blank" style="font-weight:600;" >图片专区</a>
		   </dt>
		 </dl>
	   </li>
       <li style="float:left; width:150px; text-align:center;">
	     <dl style="margin:20px 0;">
		   <dt>
		   <a href="http://www.javaxuexi.net:80/games/index.jhtml" target="_blank" style="font-weight:600;" >知识拓展</a>
		   </dt>
		 </dl>
	   </li>
	 </ul>
   </div>
   <div style="clear:both;"></div>
</div>
<div style="width: 1100px;margin: 20px auto;">
<script type="text/javascript">
    /*（生活娱乐）960*60 创建于 2015-10-30*/
    var cpro_id = "u2376992";
</script>
<script type="text/javascript" src="http://cpro.baidustatic.com/cpro/ui/c.js"></script>

  <div style="clear: both;"></div>
</div>

<div style="width: 1100px;margin: 20px auto;">
  <div style="width: 780px;float: left;">
     <h3 style="border-bottom: 1px solid #20b573;color: #333;margin: 0;">
       <a style="display:inline-block;padding-top: 8px;padding-bottom:7px;background-color: #20b573;" href="/jx/wangluozhishi/20151016/697.html" title="CCNA考试命令集总结 ">CCNA考试命令集总结 </a>
       <span style="float: right;font-size: 14px;color: #888;margin-top: 10px;">蘑菇&nbsp;&nbsp;发布于    2015-10-16 20:03:30</span>
     </h3>
     <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; CCNA考试命令集总结<br />
	&nbsp;<br />
	第1章OSI参考模型和路由</p>
<p>1.5.8 IP路由先择配置任务</p>
<p>1、IP地址配置<br />
	Router# term ip &lt;netmask-format&gt;<br />
	Router(config-if)# term ip &lt;netmask-format&gt;</p>
<p>2、动态路由选择配置<br />
	Router(config)# router &lt;rip | igrp | eigrp | ospf&gt;<br />
	Router(config-router)# network &lt;network-number&gt;</p>
<p>3、RIP<br />
	Router(config)# router rip</p>
<p><br />
	第2章 局域网交换</p>
<p>2.5 生成树协议<br />
	Router# show spantree</p>
<p><br />
	第5章 路由先择协议：IGRP</p>
<p>5.6 了解IGRP的有关*作</p>
<p>5.6.2 创建IGRP路由选择过程<br />
	Router(config)# router igrp &lt;autonomous-system&gt;<br />
	Router(config-router)# network &lt;network-number&gt;<br />
	Router(config)# no router igrp &lt;autonomous-system&gt;</p>
<p>5.6.3 提高IGRP的稳定性<br />
	Router(config-router)# timers basic &lt;更改的igrp发送更新消息的时间间隔&gt;<br />
	&lt;过期时间，常为3倍于更新时间&gt; &lt;过期后保留的最短时间，常设为0&gt;<br />
	&lt;过期后保留的最长时间，常4倍或多或5倍于更新时间&gt;<br />
	（例：Router(config-router)# timers basic 15 45 0 60，<br />
	其默认的设置为Router(config-router)# timers basic 90 270 0 450）</p>
<p>Router(config-router)# no metric holddown<br />
	(注：使用holddown命令，可以使旧的路由被去除后，新增加的路由立即生效)</p>
<p>5.6.6 最大跳数<br />
	Router(config-router)# metric maximum-hop &lt;最大跳数值0~255，默认为100）</p>
<p><br />
	第6章 访问控制列表</p>
<p>6.3 ACL配置任务<br />
	Router(config)# access-list &lt;access-list-number&gt; {permit | deny} &lt;test-conditions&gt;<br />
	Router(config-if)# {ip | ipx} access-group &lt;access-list-number&gt;</p>
<p>6.3.2 为每一个ACL分配唯一的表号<br />
	协议及其所允许的ACL表号的取值范围<br />
	协 议 ACL表号的取值范围<br />
	IP（Internet协议） 1~99<br />
	Extended IP（扩展Internet协议） 100~199<br />
	AppleTalk 600-699<br />
	IPX（互联网数据包交换） 800~899<br />
	Extended IPX（扩展互联网数据包交换） 900~999<br />
	IPX Service Advertising Protocol（IPX服务通告协议） 1000~1099<br />
	Router(config)# no access-list &lt;access-list-number&gt;</p>
<p>6.3.4 如何使用通配符any<br />
	Router(config)# access-list &lt;access-list-number&gt; {permit | deny} any<br />
	等同于：<br />
	Router(config)# access-list &lt;access-list-number&gt; {permit | deny} 0.0.0.0 255.255.255.255</p>
<p>6.3.5 如何使用通配符host<br />
	Router(config)# access-list &lt;access-list-number&gt; {permit | deny} host &lt;ip-address&gt;<br />
	(注：host &lt;ip address&gt;等同于&lt;ip-address&gt; 0.0.0.0)</p>
<p>6.4 标准访问控制列表</p>
<p>6.4.1 标准ACL的有关例子<br />
	Router(config)# access-list &lt;access-list-number&gt;<br />
	{permit | deny} &lt;source&gt; [source-wildcard] [log]<br />
	Router(config)# no access-list &lt;access-list-number&gt;<br />
	Router(config-if)# ip access-group &lt;access-list-number&gt; [in | out]<br />
	(注：如果in和out都没有指定，那么缺省地被认为是out)<br />
	Router(config-if)# no ip access-group &lt;access-list-number&gt; [in | out]<br />
	Router# show access-list</p>
<p>6.4.2 标准ACL例子1：允许一个源的通信流量通过<br />
	Router(config)# access-list &lt;access-list-number&gt; permit &lt;source&gt; [source-wildcard]<br />
	(注：末尾一句access-list &lt;access-list-number&gt; deny 0.0.0.0 255.255.255.255通常省略不写)<br />
	Router(config)# interface &lt;接口号&gt;<br />
	Router(config-if)# ip access-group &lt;access-list-number&gt; out</p>
<p>6.4.3 标准ACL例子2：拒绝一个特定主机的通信流量通过<br />
	Router(config)# access-list &lt;access-list-number&gt; deny host &lt;ip-address&gt;<br />
	Router(config)# access-list &lt;access-list-number&gt; permit 0.0.0.0 255.255.255.255<br />
	Router(config)# interface &lt;接口号&gt;<br />
	Router(config-if)# ip access-group &lt;access-list-number&gt; out</p>
<p>6.4.4 标准ACL例子3：拒绝一个特定子网的通信流量<br />
	Router(config)# access-list &lt;access-list-number&gt; deny &lt;子网号&gt; &lt;通配符掩码&gt;<br />
	Router(config)# access-list &lt;access-list-number&gt; permit any<br />
	Router(config)# interface &lt;接口号&gt;<br />
	Router(config-if)# ip access-group &lt;access-list-number&gt; out</p>
<p>6.5 扩展访问控制列表</p>
<p>6.5.1 扩展ACL的有关例子<br />
	Router(config)# access-list &lt;access-list-number&gt; {permit | deny} &lt;protocol&gt; &lt;source&gt; [source-mask &lt;destination&gt; destination-mask] [operator operand] [established] [log]<br />
	(注：operator operand中分为lt---小于、gt---大于、eq---等于、neq---不等于和一个端口号)<br />
	Router(config-if)# ip access-group &lt;access-list-number&gt; [in | out]</p>
<p>6.5.2 扩展ACL例子1：拒绝FTP通信流量通过E0<br />
	Router(config)# access-list &lt;access-list-number&gt; deny tcp<br />
	{&lt;source&gt; &lt;source-mask&gt;} {&lt;destination&gt; &lt;destination-mask&gt;} eq {21 | ftp}<br />
	Router(config)# access-list &lt;access-list-number&gt; permit ip {&lt;source&gt; &lt;source-mask&gt;} {&lt;destination&gt; &lt;destination-mask&gt;}<br />
	Router(config)# interface &lt;接口号&gt;<br />
	Router(config-if)# ip access-group &lt;access-list-number&gt;</p>
<p>6.5.2 扩展ACL例子2：只拒绝通过E0通信流量<br />
	Router(config)# access-list &lt;access-list-number&gt; deny tcp {&lt;source&gt; &lt;source-mask&gt;} any eq {23 | smtp}<br />
	Router(config)# access-list &lt;access-list-number&gt; permit ip any any<br />
	Router(config)# access-list &lt;access-list-number&gt; deny ip<br />
	Router(config)# interface &lt;接口号&gt;<br />
	Router(config-if)# ip access-group &lt;access-list-number&gt; out</p>
<p>6.6 使用命名访问控制列表<br />
	Router(config)# ip access-list {standard | extended} &lt;name&gt;<br />
	Router(config {std- | ext-}nacl)# {deny | permit} &lt;source&gt; [source-mask &lt;destination&gt; destination-mask] [log]<br />
	Router(config)# interface &lt;接口号&gt;<br />
	Router(config-if)# ip access-group &lt;access-list-number&gt; out</p>
<p>6.9 验证访问控制列表<br />
	Router# show access-lists<br />
	Router&gt; show ip interface<br />
	Router# show ip interface</p>
<p><br />
	第7章 Novell IPX</p>
<p>7.3 IPX概述<br />
	Router# telnet &lt;ipx地址&gt;<br />
	Router-A# show protocols<br />
	Router-A# show ipx interface [[Ethernet | serial | asynchronous<br />
	| dialer | Token Ring | FDDI | null | loopback |tunnel] &lt;unit&gt;]</p>
<p>7.4 Novell封装</p>
<p>7.4.1 Cisco封装的命名情况<br />
	Novell与Cisco封装的命名对比<br />
	Novell IPX的命名 Cisco IOS的命名<br />
	Ethernet_802.3 Novell-ether<br />
	Ethernet_802.2 sap<br />
	Token-Ring<br />
	FDDI_802.2<br />
	Ethernet _SNAP snap<br />
	Token-Ring _SNAP<br />
	FDDI_SNAP<br />
	Ethernet _II arpa<br />
	FDDI _RAW Novell _fddi</p>
<p>7.5 使用RIP进行Novell路由选择<br />
	Router(config)# ipx routing<br />
	或<br />
	Router(config)# ipx routing [node]<br />
	(注：对于串口必须指定node，node是一具48位的MAC，用4个点分十六进制的数：xxxx . xxxx . xxxx)<br />
	Router(config-router)# ipx maximum-paths &lt;paths&gt;<br />
	(注：开启负载均分的线路数1~512，缺省为1)<br />
	Router(config)# no ipx routing<br />
	Router(config)# ipx route eigrp<br />
	Router(config-router)# ipx network {network-number | all}</p>
<p>7.6 服务通告协议（SAP）<br />
	Number Sap Service<br />
	4 NetWare文件服务器<br />
	7 打印服务器<br />
	24 远程桥接服务器（路由器）</p>
<p>7.8 Novell IPX配置任务</p>
<p>7.8.1 Novell IPX全局配置<br />
	Router(config)# ipx routing<br />
	Router(config-router)# ipx maximum-paths &lt;1~512&gt;<br />
	(注：开启负载均分的线路数1~512，缺省为1)</p>
<p>7.8.2 给接口分配IPX网络号</p>
<p>命 令&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 命令描述<br />
	Ipx routing [node] 为IPX选择路由选择，并开始启动IPX RIP<br />
	Ipx maximum-paths &lt;1~512&gt; 允许通往目的地的计量标准值相等的几条并行路径采用负载均分，并行路径的最大数目被限制一个指定的范围之内<br />
	Interface Ethernet &lt;接口号 | 子接口号&gt; 表示要进入接口或子接口，进行相应的配置<br />
	Encapsulation &lt;与novell相对协议&gt; 可选择的协议有：Novell-ether、sap、snap、arpa、Novell _fddi<br />
	Ipx network &lt;network-number | all&gt; 分配给接口或子接口一个网络号</p>
<p>7.8.3 验证IPX*作<br />
	IPX监视命令<br />
	命 令&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 描 述<br />
	Show ipx interface 显示IPX状态和有关参数<br />
	Show ipx route 显示路由选择表内容<br />
	Show ipx servers 显示IPX服务器列表<br />
	Show ipx traffic 显示数据包的数量和类型</p>
<p>IPX故障检修命令<br />
	命 令&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 描 述<br />
	Debug ipx routing activity 有关RIP消息更新数据包的信息<br />
	Debut ipx sap 有关SAP消息更新数据包的信息<br />
	Ping 显示有关一个特定节点能否响应网球请求的有关信息</p>
<p>7.9 监视IPX接口状态<br />
	Router# show ipx interface &lt;接口类型&gt; &lt;接口号&gt;<br />
	Router(config)# ipx delay &lt;number&gt;<br />
	(注：手动修改一个接口的tick延时，默认的LAN为1 tick， WAN为6 tick)<br />
	Router# show ipx interface 0</p>
<p>7.9.2 监视IPX路由选择表<br />
	Router# show ipx route</p>
<p>7.9.2 监视Novell IPX服务器<br />
	Router# show ip servers [ sorted {name | net | type}<br />
	(注：显示的排序方式，net是指按网络号，type为默认的按类型排序)</p>
<p>7.9.4 监视IPX通信流量<br />
	Router# show ipx traffic</p>
<p>7.9.5 ipx路由选择的故障检修<br />
	Router# debug ipx routing activity</p>
<p>7.9.6 IPX SAP的故障检修<br />
	Router# debug ipx sap<br />
	SAP的响应 描 述<br />
	0x1 普通查询<br />
	0x2 普通响应<br />
	0x3 GNS（接通最近服务器）查询<br />
	0x4 GNS（接通最近服务器）响应</p>
<p>7.9.8 特权IPX ping命令<br />
	Router# ping [ipx &lt;network .node | host&gt;]<br />
	字符 定义<br />
	！ 每一个惊叹号表示从目的地址成功的接收一个应答<br />
	. 表示网络服务器在等待从目的地址接收应答时间的超时<br />
	U 接收到了一个目的地不可到达错误的PDU（协议数据单元）<br />
	C 接收到了一个经历了拥塞的数据包<br />
	I 用户终端测试<br />
	? 不知道的数据包类型<br />
	&amp; 超过寿命的数据包<br />
	中断 Ctrl + Shift + 6 + X 或 Ctrl + Shift + X<br />
	Router# ping<br />
	（注：为特权下ping的扩展）</p>
<p><br />
	第11章 PPP</p>
<p>11.3 PPP会话的建立过程<br />
	Router# show interface<br />
	(注：可以用来检查LCP和NCP的状态)<br />
	Router(config-if)# encapsulation ppp</p>
<p>11.4 PPP验证<br />
	Router# username &lt;远端路由器名&gt; password &lt;与远端相同的口令&gt;<br />
	Router# configure terminal<br />
	Router(config)# interface &lt;要配置的接口&gt;<br />
	Router(config-if)# encapsulation ppp<br />
	Router(config-if)# ppp authentication {chap | chap pap | pap chap |pap}3<br />
	/*在Cisco IOS 11.1或更高的版本中，PAP默认下不再被使用，如要使用需作以下配置*/<br />
	Router(config-if)# ppp pap sent-username &lt;username&gt; password &lt;password&gt;</p>
<p>11.4.2 配置CHAP验证<br />
	Router(config-if)# ppp chap hostname &lt;hostname&gt;<br />
	(注：此用于多对一的连接，并要求所有路由器用同一个名字)<br />
	Router(config-if)# ppp chap password &lt;secret&gt;<br />
	(注：只用密码验证的方法用于路由器向验证主机发送，对于端对端的路由则不能使用)</p>
<p><br />
	第12章 ISDN</p>
<p>12.7 ISDN配置任务<br />
	说明：<br />
	1、对于TE1线路，用BRI接口<br />
	2、对于TE2线路，可用&ldquo;BRI接口&rdquo;+&ldquo;外接的ISDN终端适配器&rdquo;，也可用&ldquo;SERIAL接口&rdquo;。</p>
<p>12.7.1 配置ISDN BRI<br />
	Router(config)# interface bri &lt;number&gt;</p>
<p>12.7.2 定义交换类型<br />
	Router(config)# isdn switch-type &lt;switch-type&gt;<br />
	(注：全局模式下的配置将在所有端口都生效，也可以在单个BRI接口下配置)<br />
	Router(config-if)# isdn switch-type {basic-ltr6 | basic-5ess | basic-dms100 | basic-net3 | basic-nil | basic-nwnet3 | basic-nznet3 | basic-ts013 | ntt | vn2 | vn3}</p>
<p>12.7.3 定义SPID<br />
	Router(config)# interface bri &lt;number&gt;<br />
	Router(config-if)# isdn spid1 &lt;spid-number 1&gt; [ldn 1]<br />
	(注：LDN的指定使得些B信道可以同时收发数据)<br />
	Router(config-if)# isdn spid2 &lt;spid-number 2&gt; [ldn 2]</p>
<p>12.7.4 BRI配置实例<br />
	Router(config)# dialer-list &lt;dialer-list-number&gt; protocol &lt;ptotocol&gt; permit<br />
	Router(config)# isdn switch-type &lt;switch-type&gt;<br />
	或（Router(config-if)# isdn switch-type &lt;switch-type&gt;）<br />
	Router(config)# interface bri &lt;interface-number&gt;<br />
	Router(config-if)# dialer-group &lt;dialer-list-number&gt;<br />
	Router(config-if)# dialer wait-for-carrier time &lt;time&gt;<br />
	Router(config-if)# dialer idle-timeout &lt;timeout&gt;<br />
	Router(config-if)# isdn spid1 &lt;spid-number 1&gt; [ldn 1]<br />
	Router(config-if)# isdn spid2 &lt;spid-number 2&gt; [ldn 2]<br />
	Router(config-if)# dialer map ip &lt;ip-address&gt; name &lt;远端路由器名&gt; &lt;telephoto-number&gt;<br />
	命令/参数&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 描 述<br />
	Isdn switch-type 指定与路由器连接的ISP商的交换机类型<br />
	dialer-list &lt;dialer-list-number&gt; protocol &lt;ptotocol&gt; permit 建立的拨号访问列表，一般是允许IP包发起ISDN呼叫<br />
	interface bri &lt;interface-number&gt; 进入ISDN接口，继续进行相关的配置<br />
	dialer-group;&lt;dialer-list-number&gt; 在BRI接口上应用dialer-list &lt;dialer-list-number&gt;，使其生效<br />
	dialer wait-for-carrier time 指定在呼叫发起后等待服务提供商响应的最大时间<br />
	dialer idle-timeout 指定路由器在空闲多小秒后终止ISDN连接</p>
<p>12.7.5 验证BRI的*作<br />
	Router# show isdn status</p>
<p>12.7.6 按需拨号请求路由先择</p>
<p>12.8.1 验证DDR<br />
	命 令&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 描 述<br />
	Ping / telnet 当ping或者telnet一个远端站点时，或者有其它的流量时，会触发一个连接。这时路由器会在链路状态消息中向控制台发送一个变化消息。<br />
	Show dialer 可以得到配置了DDR的接口的全部诊断信息，例如：拨号成功的次数以及每个B信道的空闲时间和固定空闲时间。当前的呼叫信息也能得到，比如呼叫的长度和当前与接口连接的设备的号码及名字。<br />
	Shw isdn active 当使用ISDN时可以使用该命令。它会得到当前的ISDN呼叫以及该呼叫的号码。<br />
	Show isdn status 可以得到ISDN连接的统计信息。<br />
	Show ip route 显示路由器已知的路由，包括静态和动态路由</p>
<p>12.8.2 DDR调试*作<br />
	命 令&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 描 述<br />
	Debug q921 检查是否连接到了一个ISDN交换机<br />
	Debug dialer 显示诸如接口在拨什么号码之类的信息<br />
	Clear interface 清除当前的呼叫。在查找问题时，有时这个命令会很有用，它会清除历史信息以查明当前成功和失败的呼叫次数。使用这个命令要小心，。它有时需要在本地和远端路由器上都清除呼叫<br />
	Router# debug isdn q921<br />
	Router# clear interface bri &lt;interface-number&gt;<br />
	Router&gt; show status<br />
	Router# show status</p>
<p><br />
	第13章 帧中继</p>
<p>13.6 基本帧中继的配置<br />
	Router(config)# interface serial &lt;接口号&gt;<br />
	Router(config-if)# no shutdown<br />
	Router(config-if)# ip address &lt;ip-address&gt; &lt;net-mask&gt;<br />
	Router(config-if)# encapsulation frame-relay [cisco | IETF]<br />
	Router(config-if)# frame-relay lmi-type {ansi | cisco | q933a}<br />
	(注：此条是11.2版本（不包括11.2版本）以前的配置，<br />
	Router(config-if)# bandwidth ;&lt;kilobits&gt;<br />
	/*如果路由器不支持逆向ARP，可用下面的命令使它支持。---缺省下，是支持逆向ARP的*/<br />
	Router(config-if)# frame-relay inverse-arp [IP | IPX | AppleTalk | DECnet | VINES | XNS] [dlci]</p>
<p>13.6.1 验证帧中继的有关*作<br />
	命 令&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 描 述<br />
	Show interface serial 显示组播的DLCI的相关信息。这里的DLCI被用在采用帧中继配置的串行接口上，而LMI DLCI则用在相应的LMI上<br />
	Show frame-relay pvc 显示每个已配置连接的状态信息和流量统计。这个命令也用来查看路由器接收到的BECN和FECN数据包的数量<br />
	Show frame-relay map 显示跟本地路由器相连的远端目的设置的网络层地址信息和相应的DLCI值<br />
	Show frame-relay lmi 显示LMI流量统计情况。例如：它显示本地路由器和帧中继交换机之间交换的状态消息的数量</p>
<p>13.6.2 检验线路是否处于连通状态<br />
	Router# show interface serial &lt;接口号&gt;</p>
<p>13.6.3 检验帧中继映射是否成功<br />
	Router# show frame-relay map</p>
<p>13.6.4 检验到中心站点路由器的连通性<br />
	Router# ping &lt;ip-address&gt;</p>
<p>13.6.5 配置帧中继连接的串行接口<br />
	Router(config)# interface serial &lt;接口号&gt;<br />
	Router(config-if)# encapsulation frame-relay [cisco | IETF]<br />
	Router(config-if)# no shutdown</p>
<p>13.6.6 验证帧中继的配置情况<br />
	Router(config)# show frame-relay pvc<br />
	Router(config)# show interface serial &lt;接口号&gt;<br />
	Router(config)# line console 0<br />
	Router(config-line)# exec-timeout &lt;timeout&gt;<br />
	(注：用于设定一间隔的超时时间)<br />
	Router(config#) line vty 0 4<br />
	Router(config-line)# login<br />
	Router(config-line)# password &lt;line-access&gt;</p>
<p>13.6.7 配置子接口<br />
	Router(config-if)# interface serial &lt;number.subinterface-number&gt; {multipoint | point-to-point}<br />
	;(注：subinterface-number取值范围为1~4,294,967,293 )<br />
	Router(config-if)# ip unnumbered &lt;interface&gt;<br />
	(注：推建用环回接口)<br />
	Router(config-if)# frame-relay interface-dlci &lt;dlci-number&gt;</p>
<p>13.6.8 配置可选的命令<br />
	Router(config-if)# frame-relay map &lt;protocol&gt; &lt;protocol-address&gt; &lt;dlci&gt; [broadcast] [ietf | cisco | payload-compress packet-by-packet]<br />
	Router(config-if)# keepalive &lt;number&gt;<br />
	(注：PVC维持的时间，默认为10秒；通常比ISP商的帧中继交换机设定的时间短2~3秒)</p>
<p><br />
	第14章 网络管理（第二部分）</p>
<p>14.4 排除网络故障</p>
<p>14.4.2 排除技术的过程<br />
	C:\windows\&gt; ping 127.0.0.1</p>
<p>14.4.4 软件工具<br />
	C:\windows\&gt; ping [-t] [-a] [-n] [-l] [-f] [-i] [-r] &lt;destination&gt;<br />
	-t 一直ping，直到被中断<br />
	-a Ping该地址并将其解析成主机名<br />
	-n 指定ping的次数<br />
	-l 指定数据包的长度；发送指定长度的echo数据包<br />
	-f 向网关发送&ldquo;不要分段&rdquo;的命令<br />
	-i 根据发送&ldquo;不要分段&rdquo;的命令<br />
	-r 根据ttl值设定数据包的TTL字段<br />
	Destination 为ping指定远程的主机，既可以是域名又可以是IP地址<br />
	C:\windows\&gt; tracert [-d] [-h maximum _hops] [-j host-list] [-w timeout] &lt;target _name&gt;<br />
	-d 不将IP地址解析成主机名<br />
	-h Max _hops指定了最大跟踪跳数<br />
	-j Hop-list指定了有限源路由<br />
	-w 指定了响应的超时时间，单位是毫秒<br />
	C:\windows\&gt; telnet &lt;远程主机名 | IP地址&gt;<br />
	C:\windows\&gt; netstat [-a] [-e] [-n] [-s] [-p proto] [-r] [interval]<br />
	-a 显示所有连接和处于监听状态的接口（服务器端的连接通常不显示）<br />
	-c 显示所有的以太网统计数据。这个选项可以跟-s选项一起使用</p>
<p><br />
	第17章 路由器命令行界面（CLI）</p>
<p>17.2 路由器用户界面概述<br />
	Router con0 is now available.<br />
	Press RETURN to get started.<br />
	User Access Verification<br />
	Password:<br />
	Router&gt; enable<br />
	Password:<br />
	Router#<br />
	Router# disable<br />
	Router&gt;<br />
	Router&gt;exit<br />
	To log out of the router, type exit</p>
<p>17.2.1 用户模式命令列表<br />
	/*进入方式*/<br />
	Password:<br />
	Router&gt; ？<br />
	命&nbsp; 令&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 描述<br />
	Access-enable 创建一条临时的访问控制列表条目<br />
	Atmsig 执行有关ATM信令的命令<br />
	Cd 改变妆当前的设备<br />
	Clear 将变量清空<br />
	Connect 打开一个终端连接<br />
	Dir 列出给定设备上的文件<br />
	Disable 退出特模式<br />
	Disconnect 关闭一个已经存在的网络连接<br />
	Enable 进入特许模式<br />
	Exit 退出EXEC<br />
	Help 获得关于IOS交互式帮助系统的描述<br />
	Lat 打开一个LAT连接<br />
	Lock 锁定终端<br />
	Login 用特定的用户登录<br />
	Logout 退出EXEC<br />
	Mrinfo 向组播路由器询问邻居和版本的信息<br />
	Mstat 显示多次组播路由跟踪的统计信息<br />
	Mtrace 跟踪从目的到源的反向组播路径<br />
	Name-connection 为已经存在的连接命名<br />
	Pad 打开一个X.29 PAD连接<br />
	Ping 发送echo消息<br />
	Ppp 启动IETF点到协议（ppp）<br />
	Pwd 显示当前的设备<br />
	Resume 继续一个活动的连接<br />
	Rlogin 打开一个rlogin连接<br />
	Show 显示运行系统的信息<br />
	Slip 启动串行线路IP协议（SLIP）<br />
	Systat 显示有关终端连接的信息<br />
	telnet 打开一个telnet连接<br />
	Terminal 设置终端连接的参数<br />
	Tn3270 打开一个TN3270连接<br />
	Traceroute 启动到目的地的路由跟踪<br />
	Tunnel 打开一个隧道（tunnel）连接<br />
	Where显示所有地活动连接<br />
	X3 在PAD上设置X.3参数<br />
	Xremote 进入Xremote模式</p>
<p>17.2.2 特许模式命令列表<br />
	/*进入方式*/<br />
	Password:<br />
	Router&gt; enable<br />
	Password:<br />
	Router# ?<br />
	（注：以下红色为是特许模式与用户模式相重复的命令）<br />
	命令&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 描述<br />
	Access-enable 创建一条临时的访问控制列表条目<br />
	Access-template 创建一条临时的访问控制列表条目<br />
	Appn 向APPN子系统发送一条命令<br />
	Atmsig 执行有关ATM信令的命令<br />
	Bfe 设置手工紧急模式<br />
	Calendar 管理硬件的日志<br />
	Cd 改变妆当前的设备<br />
	Clear 将变量清空<br />
	Clock 管理系统的时钟<br />
	Cmt 启动和停止FDDI连接管理<br />
	Configure 进入全局配置模式<br />
	Connect 打开一个终端连接<br />
	Copy 拷贝配置或映像数据<br />
	Debug 使用调试功能（与unduebug相反）<br />
	Delete 删除一个文件<br />
	Dir 列出给定设备上的文件<br />
	Disable 退出特模式<br />
	Disconnect 关闭一个已经存在的网络连接<br />
	Enable 进入特许模式<br />
	Erase 擦除闪存（Flash）或存放配置文件的存储器中的内容<br />
	Exit 退出EXEC<br />
	Format 格式化某个设备<br />
	Help 获得关于IOS交互式帮助系统的描述<br />
	Lat 打开一个LAT连接<br />
	Lock 锁定终端<br />
	Login 用特定的用户登录<br />
	Logout 退出EXEC<br />
	Mbranch 沿树枝向下跟踪组播路由<br />
	Mrbranch 沿树枝向上跟踪反向的组播路由<br />
	Mrinfo 向组播路由器询问邻居和版本的信息<br />
	Mstat 显示多次组播路由跟踪的统计信息<br />
	Mtrace 跟踪从目的到源的反向组播路径<br />
	Name-connection 为已经存在的连接命名<br />
	Nica 启动/停止NCIA服务器<br />
	Pad 打开一个X.29 PAD连接<br />
	Ping 发送echo消息<br />
	Ppp 启动IETF点到协议（ppp）<br />
	Pwd 显示当前的设备<br />
	Reload 关机并执行冷启动<br />
	Resume 继续一个活动的连接<br />
	Rlogin 打开一个rlogin连接<br />
	Rsh 执行一个远程命令<br />
	Sdlc 发送SDLC测试帧<br />
	Send 在tty连接上发送消息<br />
	Setup 启动setup命令配置工具<br />
	Show 显示运行系统的信息<br />
	Slip 启动串行线路IP协议（SLIP）<br />
	Squeeze 挤压某个设备<br />
	Start-chat 在一个连接上启动一个聊天脚本<br />
	Systat 显示有关终端连接的信息<br />
	Tarp 目标有关终端连接的信息<br />
	telnet 打开一个telnet连接<br />
	Terminal 设置终端连接的参数<br />
	Tn3270 打开一个TN3270连接<br />
	Traceroute 启动到目的地的路由跟踪<br />
	Tunnel 打开一个隧道（tunnel）连接<br />
	Undebug 停止调试功能（与duebug相反）<br />
	Verify 检查某个Flash文件的校验和<br />
	Where 显示所有地活动连接<br />
	Write 将当前运行的配置文件写入存储器、网络或终端<br />
	X3 在PAD上设置X.3参数<br />
	Xremote 进入Xremote模式</p>
<p>17.3 使用路由器的帮助功能<br />
	Router# clok<br />
	Translating &rdquo;clok&rdquo;<br />
	% Unknown command or computer name，or unable to find computer address<br />
	Router# cl?<br />
	Clear clock<br />
	Router# clock<br />
	% Incomplete command.<br />
	Router# clock ?<br />
	Set Set the time and date<br />
	Router# clock set<br />
	% Incomplete command.<br />
	Router# clock set ?<br />
	Current time (hh : mm : ss)<br />
	Router# clock set 19:56:00<br />
	% Incomplete command.<br />
	Router# clock set 19:56:00 ?<br />
	&lt;1-31&gt; Day of the month<br />
	Month Month of the year<br />
	Router# clock set 19:56:00 04 8<br />
	^<br />
	% Invalid input detected at the &ldquo;^&rdquo; marker<br />
	Router# clock set 19:56:00 04 August<br />
	% Incomplete command.<br />
	Router# clock set 19:56:00 04 August ?<br />
	&lt;1993-2035&gt; Year<br />
	Router# clock set 19:56:00 04 August 2002 ?<br />
	&lt;cr&gt;<br />
	Router# clock set 19:56:00 04 August 2002<br />
	(完)</p>
<p>17.4 使用IOS的编辑命令<br />
	命令&nbsp;&nbsp;&nbsp;&nbsp; 描述<br />
	Ctrl + A 移至命令行开头<br />
	Ctrl + E 移至命令行末尾<br />
	Ctrl + F 前移一个字符<br />
	Ctrl + B 后移一个字符<br />
	Esc + B 前移一个单词<br />
	Esc + F 后移一个单词</p>
<p>17.5 使用IOS的命令历史功能<br />
	命令&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 描述<br />
	Ctrl + P 或 &uarr;（向上箭头） 重用前一条命令<br />
	Ctrl + N 或 &darr;（向下箭头） 重用下一条命令<br />
	Show history 显示命令缓冲区的内容<br />
	Terminal history [size number-of line] 设置命令缓冲区的大小<br />
	No terminal editing 禁用高级编辑特性<br />
	Terminal editing 重新启用高级编辑特性<br />
	Tab 完成命令行<br />
	Terminal history size [0-256] 设置历史缓冲区中的大小（默认10条）<br />
	History size [0-256] 设置历史缓冲区中的大小（默认10条）</p>
<p><br />
	第18章 路由器组件</p>
<p>18.3 使用路由器状态命令检查路由器的状态<br />
	命令&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 描述<br />
	Show version 显示系统的硬件配置、软件版本、配置文件的名称和来源、启动映象的信息以及最近一次系统重动的原因<br />
	Show flash 显示闪存设备的信息<br />
	Show processes 显示有关活动进程的信息<br />
	Show processes cpu 显示CPU活动进程的信息<br />
	Show memory 显示有关路由器内存的统计信息，包括内存空闲的统计信息<br />
	Show stacks 监视进程和终端例程所使用的堆栈<br />
	Show buffers 显示有关路由器缓冲空间统计信息<br />
	Show startup-config Cisco IOS 13.0以后版本，用于显示备份的配置文件<br />
	Show config Cisco IOS 13.0以前版本，用于显示备份的配置文件<br />
	Show running-config Cisco IOS 13.0以后版本，用于显示活动的配置文件<br />
	Write terminal Cisco IOS 13.0以前版本，用于显示活动的配置文件<br />
	Show protocols 显示已经配置的协议。该命令能显示所配置的任何一种3层（网络层）协议的状态<br />
	Show interface 显示路由器上进行了配置的所有端口的统计信息<br />
	Show arp 显示路由器的IP到MAC（接口的）地址映射</p>
<p>18.4.1 Showing CDP Neighbor所获得的各项信息<br />
	Router# show cdp neighbors<br />
	显示的信息：<br />
	Devie identifiers（设备标识） 路由器所配置的用户名、域名<br />
	Address list（地址列表） 每个协议对一个地址，至少用于一个SNMP的地址<br />
	Port identifier（端口标识） 如：E0、S0<br />
	Capabilities list（功能列表） 例如：是否既是源路由器网桥又是路由器的信息<br />
	Version（版本) 与show version获得的信息相同<br />
	Platform（Platform） 设备的硬件平台，如：CISCO 7000</p>
<p>18.4.2 CDP的一个配置实例<br />
	Router (config-if)# cdp enable<br />
	Router (config-if)# cdp disable<br />
	Router# show cdp interface</p>
<p>18.4.3 Showing CDP Neighbors<br />
	Router# show cdp neighbors<br />
	Router# show cdp neighbors detail<br />
	Router# show cdp interface<br />
	Router# show interface</p>
<p>18.5 基本网络测试</p>
<p>18.5.1 用Telnet命令测试应用层<br />
	Router&gt; telnet &lt;远端CISCO设备名，例如：Router110&gt;<br />
	或<br />
	Router&gt; connect &lt;远端CISCO设备名，例如：Router110&gt;<br />
	或<br />
	Router&gt; &lt;直接输入远端CISCO设备名，例如：Router110&gt;<br />
	或<br />
	Router&gt; &lt;直接输入远端CISCO设备IP地址&gt;<br />
	/*Resume a Session（enter session number orname）*/<br />
	Router110&gt; show session<br />
	1* Router110<br />
	2 Router<br />
	Router110&gt; 2<br />
	Router&gt;<br />
	Router&gt; show session<br />
	1 Router110<br />
	2* Router<br />
	Router&gt;1<br />
	Router110&gt;<br />
	/*End a session*/<br />
	Router110&gt; exit<br />
	或<br />
	Router110&gt; logout<br />
	或<br />
	Ctrl + shift + 6 +x</p>
<p>18.5.2 用ping命令测试网络层<br />
	Router&gt; ping &lt;远端CISCO设备名&gt;<br />
	Router&gt; ping &lt;ip地址&gt;<br />
	Router# ping &lt;远端CISCO设备名&gt;<br />
	Router# ping &lt;ip地址&gt;<br />
	Router&gt; ping ipx &lt;ipx地址&gt;<br />
	Router# ping ipx &lt;ipx地址&gt;<br />
	Router# ping<br />
	(注：不加参数可用于ping的扩展)</p>
<p>18.5.3 用trace命令测试网络层<br />
	Router&gt; Trace &lt;远端CISCO设备名&gt;<br />
	Router&gt; Trace ip &lt;IP地址&gt;<br />
	Router# Trace &lt;远端CISCO设备名&gt;<br />
	Router# Trace ip &lt;IP地址&gt;</p>
<p>18.5.4 用show ip route命令测试网络层<br />
	Router&gt; show ip route<br />
	Router# show ip route</p>
<p>18.5.5 使用show interfaces serial命令测试物理层和数据链路层<br />
	Router&gt; show interface serial&lt;接口号&gt;<br />
	Router# show interface serial&lt;接口号&gt;</p>
<p>18.5.6 Show interfaces和clear counters<br />
	Router&gt; show interface<br />
	Router# show interface<br />
	Router# clear counters</p>
<p>18.5.7 用debug命令查实时的网络通信</p>
<p><br />
	第20章 路由器配置（一）</p>
<p>20.2 *作IOS11.x版本的配置文件<br />
	命令&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 描述<br />
	Configure terminal 从控制台终端手工配置路由器<br />
	Copy tftp running-config 从网络中的TFTP服务器上加载配置文件<br />
	Configure network Cisco IOS 13.0以前版本，现在由Copy tftp running-config命令替换<br />
	Copy startup-config running-config 从NVRAM中加载配置文件(多用于口令恢复)<br />
	Configure memory Cisco IOS 13.0以前版本，现在由Copy startup-config running-config命令替换<br />
	Show running-config 显示RAM中的当前配置<br />
	Write terminal Cisco IOS 13.0以前版本，现在由show running-config 命令替换<br />
	Copy running-config tftp 将RAM中的当前配置保存到网络中的TFTP服务器上<br />
	Write network Cisco IOS 13.0以前版本，现在由Copy running-config tftp命令替换<br />
	Copy running-config startup-config 将RAM中的当前配置保存到NVRAM中<br />
	Write memory Cisco IOS 13.0以前版本，现在由Copy running-config startup-config命令替换<br />
	Show startup-config 显示NVRAM中保存的配置的内容<br />
	Show config Cisco IOS 13.0以前版本，现在由show startup-config 命令替换<br />
	Erase startup-config 清空NVRAM的内容<br />
	Write erase Cisco IOS 13.0以前版本，现在由erase startup-config 命令替换</p>
<p>20.3 路由器的配置模式<br />
	配置模式&nbsp;&nbsp;&nbsp;&nbsp; 提示符<br />
	用户EXEC模式 Router&gt;<br />
	特许EXEC模式 Router#<br />
	全局配置模式 Router(config)#<br />
	Interface&nbsp;&nbsp;&nbsp; Router(config-if)#<br />
	Subinterface Router(config-subif)#<br />
	Controller&nbsp;&nbsp; Router(config-controller)#<br />
	Map-list&nbsp;&nbsp;&nbsp;&nbsp; Router(config-map-list)#<br />
	Map-class&nbsp;&nbsp;&nbsp; Router(config-map-class)#<br />
	Line&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Router(config-line)#<br />
	Router&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Router(config-router)#</p>
<p>20.3.1 全局配置模式<br />
	/*特许EXEC模式下的configure命令*/<br />
	Router con0 is now available. &gt;Press RETURN to get started.<br />
	User Access Verification<br />
	Password:<br />
	Router&gt;<br />
	Router&gt; enable<br />
	Password:<br />
	Router#<br />
	Router# configure terminal<br />
	Router(config)#<br />
	Router(config)#interface Ethernet 0/0<br />
	Router(config-if)#<br />
	Router(config-if)# exit<br />
	Router(config)#<br />
	Router(config)# exit<br />
	Router#<br />
	Router# disable<br />
	Router&gt;<br />
	Router&gt; exit<br />
	Press RETURN to get started.<br />
	或用快速的退出方法：<br />
	Router(config-if)# end<br />
	(注：end和Ctrl + Z的作用一样)<br />
	Router#<br />
	Router# exit<br />
	Press RETURN to get started.</p>
<p>20.3.2 配置路由协议<br />
	Router# configure terminal<br />
	Router(config)# router &lt;路由协议&gt;<br />
	Router(config-router)# （command）<br />
	Router(config-router)#</p>
<p>20.3.3 配置某个接口*/<br />
	Router# configure terminal<br />
	Router(config)# interface &lt;端口类型&gt; &lt;端口号&gt;<br />
	或<br />
	Router(config)# interface &lt;端口类型&gt; &lt;模块所在的插槽号 / 端口号&gt;<br />
	Router(config-if)# no shutdown<br />
	Router(config-if)#</p>
<p>20.3.4 配置特定的接口<br />
	Router(config)# interface serial 1/0<br />
	Router(config-if)# no shutdown<br />
	Router(config-if)# bandwidth 56<br />
	Router(config-if)# clock rate 56000<br />
	Router(config-if)#<br />
	Router(config-if)# int &amp; 0.1 point-to point<br />
	Router(config-if)# int &amp; 0.2 point-to point<br />
	/*Cisco 4000系列路由器*/<br />
	Router(config)# interface Ethernet 1/0<br />
	Router(config-if)# media-type 10baset<br />
	Router(config-if)#</p>
<p>20.4 配置方法</p>
<p>20.4.3 配置口令的方法<br />
	Router(config)# line console 0<br />
	Router(config-line)# login<br />
	Router(config-line)# password &lt;口令&gt;<br />
	Router(config)# line vty 0 4<br />
	Router(config-line)# login<br />
	Router(config-line)# password &lt;口令&gt;<br />
	Router(config)# enable password &lt;口令&gt;<br />
	Router(config)# enable secret &lt;口令&gt;<br />
	/*启动加密服务，为所有的口令加密*/<br />
	Router(config)# service password-encryption<br />
	Router(config)# no service password-encryption</p>
<p>20.4.4 路由器标识配置<br />
	/*路由器名称*/<br />
	Router(config)# hostname &lt;路由器名称,如：Tokyo&gt;<br />
	Tokyo#<br />
	/*登录标题*/<br />
	Router(config)# banner motd #<br />
	&lt;欢迎信息，如：Welcome!!!&gt; #<br />
	Router(config)#<br />
	/*接口描述*/<br />
	Router(config)# interface Ethernet 0<br />
	Router(config-if)# description &lt;接口描述信息&gt;</p>
<p><br />
	第21章 IOS映象</p>
<p>21.2 （用boot system命令）定位Cisco IOS软件</p>
<p>1、先从此启动<br />
	Router# configure terminal<br />
	Router(config)# boot system flash &lt;IOS_ filename&gt;<br />
	Router(config)# boot system tftp &lt;IOS_ filename&gt; tftp_address<br />
	Router(config)# boot system rom<br />
	Router(config)# end<br />
	Router# copy running-config startup-config</p>
<p>2、NVROM中没有boot system命令语句时，从flash中取得缺省的Cisco IOS软件。</p>
<p>3、Flash为空时，从TFTP服务器获获得缺省的Cisco IOS软件</p>
<p>21.2.1 配置寄存器的值<br />
	Router# configure terminal<br />
	Router(config)# config-register &lt;0x102~0x10F&gt;<br />
	config-register的值：<br />
	值&nbsp;&nbsp;&nbsp; 描述<br />
	0x100 使用ROM monitor 模式（用b命令手启动）<br />
	0x101 自动从ROM中启动（中路由器没有Flash时的缺省情况）<br />
	0x102~0x10F 执行NVRAM中的boot system命令（有Flash时，0x102缺省值）</p>
<p>21.2.2 show version命令<br />
	Router&gt; show version<br />
	Router# show version<br />
	（用于查看启动映象文件的位置及名称、配置寄存器的值）</p>
<p>21.2.4 为使用TFTP作备<br />
	Router# ping &lt;TFTP服务器地址&gt;<br />
	Router# show flash</p>
<p>21.3 IOS命名规则<br />
	示例 硬件平台 特性 运行的位置及压缩状态<br />
	Cpa25-cg-l CiscoPro 2500 (cpa 2500) 通信服务器/远程接收服务器和ISDN（cg） 可重新定位，未压缩（l）<br />
	Igs-inr-l Cisco ICG ,2500和3xxx（igs） IP子集，Novell IPX和IBM（IBM base option）(inr) 可重新定位，未压缩（l）<br />
	C4500-aj-m Cisco 4500和4700 （c4500） APPN和用于低端/中等规模的企业子集（aj） RAM，未压缩（m）<br />
	Gs7-k-mz Cisco 7000和7010 （gs7） 用于高端的企业特性（k） RAM，未压缩（mz）</p>
<p>21.4 创建备份软件映象<br />
	Router# ping &lt;TFTP服务器地址&gt;<br />
	Router# show flash<br />
	Router# copy flash tftp</p>
<p>21.5 copy tftp flash命令<br />
	Router# ping &lt;TFTP服务器地址&gt;<br />
	Router# copy tfpt flash</p>
<p><br />
	第22章 路由器配置（二）</p>
<p>22.3 口令恢复</p>
<p>22.3.1 口令恢复技术1<br />
	/*针对Cisco 2500、3000、7000系列路由器*/</p>
<p>1、 Router&gt; show version<br />
	(注：查看并记录&ldquo;配置寄存器的的设置&rdquo;值，通常是0x2102或0x102)</p>
<p>2、 重新开机，按BREAK、Ctrl + Break、Alt + Break等进入 &rdquo;&gt;&rdquo; 提示符下：<br />
	&gt;o/r {0x42 | 0x41}<br />
	值&nbsp;&nbsp; 描述<br />
	0x42 从Flash中启动，不加载配置文件startup-config.(此为最好的默认设置)<br />
	0x41 Flash丢失时用，但下一步时你只能查看、清除配置文件，不能改口令。<br />
	&gt;i (注：此命令为重新启动路由器)</p>
<p>3、 在开机进入SETUP时，回答NO或按Ctrl + C；进行下一步*作：<br />
	Router&gt;<br />
	Router&gt; enable<br />
	Router#<br />
	Router# copy startup-config running-config<br />
	Router# configure terminal<br />
	Router(config)# enable password &lt;新口令&gt;<br />
	Router(config)# enable secret &lt;新口令&gt;<br />
	Router(config)# exit<br />
	Router# copy running-config startup-config<br />
	Router# configure terminal<br />
	Router(config)# config-register &lt;show version中记录的值，通常为0x2102&gt;<br />
	Router(config)# exit<br />
	Router# reload</p>
<p>22.3.2 口令恢复技术2<br />
	/*针对Cisco 1003、4500系列路由器*/</p>
<p>1、 Router&gt; show version<br />
	(注：查看并记录&ldquo;配置寄存器的的设置&rdquo;值，通常是0x2102或0x102)</p>
<p>2、 重新开机，在60秒内按BREAK、Ctrl + Break、Alt + Break等进入&rdquo;rommon&gt;&rdquo;提示符下：<br />
	Rommon&gt; confreg<br />
	&hellip;&hellip;&hellip;&hellip;.<br />
	Do you wish to change configuration [y/n]: yes<br />
	Ignore system config[y/n]: yes<br />
	Change boot characteristics[y/n]: yes<br />
	&hellip;&hellip;&hellip;&hellip;&hellip;..<br />
	(注：其它的均回答NO，然后进入&ldquo;boot:&rdquo;提示符下)<br />
	Boot: {2 | 1}<br />
	值 描述<br />
	2 从Flash中启动，不加载配置文件startup-config.(此为最好的默认设置)<br />
	1 Flash丢失时用，但下一步时你只能查看、清除配置文件，不能改口令。<br />
	Do you wish to change configuration [y/n]: no<br />
	(注：回答NO后，系统又返回到&rdquo;rommon&gt;&rdquo;提示符下)<br />
	Rommon&gt; reset<br />
	(注：此命令为重新启动路由器)</p>
<p>3、 在开机进入SETUP时，回答NO或按Ctrl + C；进行下一步*作：<br />
	Router&gt;<br />
	Router&gt; enable<br />
	Router#<br />
	Router# copy startup-config running-config<br />
	Router# configure terminal<br />
	Router(config)# enable password &lt;新口令&gt;<br />
	Router(config)# enable secret &lt;新口令&gt;<br />
	Router(config)# exit<br />
	Router# copy running-config startup-config<br />
	Router# configure terminal<br />
	Router(config)# config-register &lt;show version中记录的值，通常为0x2102&gt;<br />
	Router(config)# exit<br />
	Router# reload</p>
<p><br />
	第24章 IP寻址</p>
<p>24.3 IP地址配置<br />
	Router# term ip &lt;netmask-fromat&gt;<br />
	(注：全局模式下的配置，对所有的接口都起作用)<br />
	命令级别 命令 用途<br />
	Router(config-if)# Ip address &lt;ip-address&gt; &lt;subnet_mask&gt; 为接口指定地址和子网掩码：启动IP处理<br />
	Router(config-if)# Term ip &lt;netmask-format&gt; {bitcount | decimal | hexadecimal} 为当前会话指定网络掩码的格式<br />
	Router(config-if)# Ip &lt;netmask-format&gt;{bitcount | decimal | hexadecimal} 为访问路由器的某条线路设定网络掩码的格式</p>
<p>24.3.1 ip host命令<br />
	Router(config)# ip host &lt;name&gt; [tcp-port-number] &lt;address {address}&gt;</p>
<p>26.2.4 ip default-network命令<br />
	Router(config)# ip default-network &lt;目标网络号&gt;<br />
	(注：配合路由协使用，用其中的一个动态路由号作默认路由配置)<br />
	Router(config)# ip route 0.0.0.0 0.0.0.0 &lt;下一路由器IP地址 | 从本地出口的地址&gt;<br />
	(注：只有一个公网地址时，在出口路由器上的配置)</p>
<p>26.3 内部路由选择协议</p>
<p>26.3.4 使用router和network命令<br />
	Router(config)# router &lt;路由协议rip | igrp | eigrp | ospf | is-is等&gt; [自主系统号]<br />
	Router(config-router)# network &lt;直接相连的要用此路由协议的网络号&gt;<br />
	Router(config-router)# network &lt;直接相连的要用此路由协议的网络号&gt;<br />
	。。。。。。。。。。。。。。。。。。。。。。。。。。。。。。</p>
<p>26.4 路由信息协议RIP<br />
	Router(config)# router rip<br />
	Router(config-router)# network &lt;直接相连的要用rip协议的有类别网络号&gt;<br />
	Router# show ip protocols<br />
	Router# show ip route<br />
	Router# debug ip rip</p>
<p>26.5 内部网关路由协议IGRP<br />
	Router(config)# router igrp &lt;自主系统号&gt;<br />
	Router(config-router)#network &lt;直接相连的要用igrp协议的有类别网络号&gt;<br />
	Router# show ip interface<br />
	Router# show ip protocols<br />
	Router# show ip route<br />
	Router# debug ip rip</p>
<p><br />
	第27章 排除网络故障</p>
<p>27.3排除网络故障的一个总体模型<br />
	Router# ping &lt;有故障的主机 | 有故障的IP地址&gt;<br />
	Router# show ip route<br />
	Router# show interface &lt;有故障的接口&gt;<br />
	Router# show run</p>
<p>27.4 IP的故故障排除</p>
<p>27.4.3 检查可用的路由<br />
	Router# show ip route &lt;有故障的IP地址&gt;</p>
<p>27.4.4 跟踪路由(Tracing the Route)<br />
	SUN-A&gt; traceroute &lt;有故障的主机 | 有故障的IP地址&gt;<br />
	C:\windows\&gt; winipcfg<br />
	C:\windows\&gt; ipconfig<br />
	C:\windows\&gt; ipconfig / all<br />
	C:\windows\&gt; tracert &lt;有故障的主机, | 有故障的IP地址&gt;</p>
<p>27.4.5 使用扩展的ping来跟踪连接性<br />
	Router# ping</p>
<p>27.5 其它可能的故障</p>
<p>27.5.1 一个地十解析（ARP）的故障<br />
	Router# show arp<br />
	Router# show interface &lt;有故障的接口&gt;<br />
	C:\windows\&gt; arp -a<br />
	SUN-A&gt; arp &ndash;a</p>
<p>27.5.2 验证终端系统的路由表<br />
	C:\windows\&gt; netstat &ndash;rn<br />
	C:\windows\&gt; route &ndash;f add 0.0.0.0 mask 0.0.0.0 &lt;需要添加入的网关地址&gt;<br />
	C:\windows\&gt; route [&ndash;f ] [[print | add | delete | change] [destination] [mask netmask] [gateway]]<br />
	C:\windows\&gt; route add &lt;ip地址&gt; mask &lt;网络掩码&gt; &lt;网关ip地址&gt;<br />
	C:\windows\&gt; route delete &lt;ip地址&gt; mask &lt;网络掩码&gt; &lt;网关ip地址&gt;<br />
	C:\windows\&gt; nbtstat &lt;相应的参数&amp;gt;<br />
	SUN-A&gt; netstat -rn</p>
<p><br />
	附录B：命令汇总</p>
<p>命令 描述 章<br />
	Access-enable 创建一条临时的访问控制列表条目 17<br />
	Access-template 创建一条临时的访问控制列表条目 17<br />
	Appn 向APPN子系统发送一条命令 17<br />
	Atmsig 执行有关ATM信令的命令 17<br />
	B 手动引导*作系统 21<br />
	Bandwidth 设置接口的带宽 20<br />
	Banner motd 指定日期信息标语 20<br />
	Bfe 设置手工紧急模式 17<br />
	Boot system 指定路由器启动时加载的系统映象 21<br />
	Calendar 管理硬件的日志 17<br />
	Cd 改变妆当前的设备 17<br />
	Cdp enable 允许接口运行CDP协议 18<br />
	Clear 将变量清空 17<br />
	Clear counters 消除接口计数器 18<br />
	Clock 管理系统的时钟 17<br />
	Clock rate 设置串口硬件接口连接时钟速率，如：网络接口模块、处理器能接收的速率 20<br />
	Cmt 启动和停止FDDI连接管理 17<br />
	Config-register 修改配置寄存器设置 21<br />
	Configure 进入全局配置模式 17，18，19<br />
	Configure memory 从NVRAM加载配置信息 20<br />
	Configure terminal 从终端进行手动配置 20，21<br />
	Connect 打开一个终端连接 17<br />
	Copy 拷贝配置或映像数据 17<br />
	Copy startup-config running-config 从NVRAM加载配置信息 21<br />
	Copy flash ftp 备份系统映象文件到TFTP服务器 21<br />
	Copy running-config startup-config 将RAM中的当前配置存储到NVRAM 20，21<br />
	Copy running-config tftp 将RAM中的当前配置存储到网络TFTP服务器上 20</p>
<p><br />
	&nbsp;</p>

     
         <ul>
            <li><strong>上一篇：</strong><a href="/jx/wangluozhishi/20151020/800.html">华为路由交换虚拟机</a></li>
            <li><strong>下一篇：</strong><a href="/jx/wangluozhishi/20151016/696.html">三层交换机vlan入门到精通</a></li>
         </ul>
         
     <div style="clear: both;"></div>    
  </div>
  <div style="width: 300px;float: right;border-left: 1px solid #ccc;border-right: 1px solid #ccc;border-top: 1px solid #ccc;">
     <span style="display: block;padding-top: 10px;padding-bottom: 10px;padding-left: 15px;background-color: #fafbfc;border-bottom: 1px solid #ccc;">相关内容</span>
     <dl>
       <dt style="color:#333;font-size: 18px;padding: 0 10px;"><a href="/jx/wangluozhishi/20161017/1705.html" target="_blank" title="电脑出现能用QQ能玩玩游戏、但是不能打开网页的现象 ">电脑出现能用QQ能玩玩游戏、但是...</a></dt>
       <dt style="color: #888;font-size: 14px;margin-top:10px;padding: 0 10px;">
	电脑出现能用QQ能玩玩游戏、但是不能打开网页的现象&nbsp; 


	&nbsp;这种情况是DNS解析的问题，建议在路由器和计算机网卡上手动设置DNS服务器地址(ISP局端提供的地址)。另外，在“DHCP服务”设置项，也手动...</dt>
     </dl>	   		                                
     <dl>
       <dt style="color:#333;font-size: 18px;padding: 0 10px;"><a href="/jx/wangluozhishi/20151223/1605.html" target="_blank" title=" 宽带路由器线路不通，无法建立连接 "> 宽带路由器线路不通，无法建立...</a></dt>
       <dt style="color: #888;font-size: 14px;margin-top:10px;padding: 0 10px;">
	&nbsp;宽带路由器线路不通，无法建立连接&nbsp; 


	1.&nbsp;用网线将路由器的WAN口与ADSL&nbsp;Modem相连，电话线连ADSL&nbsp;Modem的“Line”口。ADSL&nbsp;Modem与宽带路由器之间的连接应当使用直通线。&...</dt>
     </dl>	   		                                
     <dl>
       <dt style="color:#333;font-size: 18px;padding: 0 10px;"><a href="/jx/wangluozhishi/20151223/1606.html" target="_blank" title="为什么上网一段时间后就掉线，关闭路由器后再开启又可以连通 ">为什么上网一段时间后就掉线，关...</a></dt>
       <dt style="color: #888;font-size: 14px;margin-top:10px;padding: 0 10px;">
	为什么上网一段时间后就掉线，关闭路由器后再开启又可以连通&nbsp; 


	1)&nbsp;网络中过多DHCP服务器引起IP地址混乱。您需要将网络中的所有DHCP服务器关闭，使用手动指定IP地址方式或仅保留一个DHCP服务器...</dt>
     </dl>	   		                                
     <dl>
       <dt style="color:#333;font-size: 18px;padding: 0 10px;"><a href="/jx/wangluozhishi/20151223/1607.html" target="_blank" title="Netstat用于显示与IP、TCP、UDP和ICMP协议相关的统计数据">Netstat用于显示与IP、TCP、UDP...</a></dt>
       <dt style="color: #888;font-size: 14px;margin-top:10px;padding: 0 10px;">
	Netstat用于显示与IP、TCP、UDP和ICMP协议相关的统计数据，一般用于检验本机各端口的网络连接情况。
&nbsp;&nbsp;&nbsp;&nbsp;如果你的计算机有时候接收到的数据报导致出错数据或故障，你不必感到奇怪，TCP/IP...</dt>
     </dl>	   		                                
     <dl>
       <dt style="color:#333;font-size: 18px;padding: 0 10px;"><a href="/jx/wangluozhishi/20151223/1608.html" target="_blank" title="tracert路由器追踪命令">tracert路由器追踪命令</a></dt>
       <dt style="color: #888;font-size: 14px;margin-top:10px;padding: 0 10px;">
	tracert路由器追踪命令

 Tracert（跟踪路由）是路由跟踪实用程序，用于确定&nbsp;IP&nbsp;数据报访问目标所采取的路径。 


	该命令用&nbsp;IP&nbsp;生存时间&nbsp;(TTL)&nbsp;字段和&nbsp;ICMP&nbsp;错...</dt>
     </dl>	   		                                
<script type="text/javascript">
    /*300*250矩形*/
    var cpro_id = "u2790529";
</script>
<script type="text/javascript" src="http://cpro.baidustatic.com/cpro/ui/c.js"></script>
  </div>
  <div style="clear: both;"></div>
</div>

<div style="width:1100px; background-color:#fafbfc; margin:20px auto; border:1px solid #ccc; min-height:120px;">
   <div style="width:1100px; margin:0 auto; background-color:#20b573;">
     <span style=" display:block; width:100px; padding-top:10px; padding-bottom:10px; text-align:center; float:left; background-color:#99ff99">友情链接</span>
     <div style="clear:both;"></div>
   </div>
   <div style="width:100%;">
     <a href="#">Java web自学网</a>
	 <a href="#">Java web自学网</a>
	 <a href="#">Java web自学网</a>
	 <a href="#">Java web自学网</a>
	 <a href="#">Java web自学网</a>
	 <div style="clear:both;"></div>
   </div>
  <div style="clear:both;"></div>
</div>

<div style="width:1100px; margin:20px auto;">
   <span style="display:block; padding:10px; text-align:center;">
     2004-2016 www.javaxiangmu.cn All Rights Reserved. java香木瓜网 版权所有
   </span>
  <div style="clear:both;"></div>
</div></body>
</html>